In [1]:
%load_ext sql
%sql sqlite:///DBproject.db

In [2]:
%%sql
drop table if exists Member;

CREATE TABLE Member ( 
    Member_id text NOT NULL,
    Name text Not NULL,
    Birthday text Not NULL,
    Age_group text Not NULL,
    Address text Not NULL,
    Phone text Not NULL,
    Gender text Not NULL,
    Locker_useage Not NULL,
    Locker_id int NULL,
    Trainer_id text NULL,
    Administer_id int NOT NULL,
    TotalCost int Not NULL,
    
    primary key (Member_id),
    foreign key (Age_group) references Cost(Age_group),
    foreign key (Locker_id) references Locker(Locker_id),
    foreign key (Trainer_id) references Trainer(Trainer_id),
    foreign key (Administer_id) references Administer(Administer_id)
);

 * sqlite:///DBproject.db
(sqlite3.OperationalError) database is locked
[SQL: drop table if exists Member;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [3]:
%%sql

drop table if exists Administer;
CREATE TABLE Administer ( 
    Administer_id int NOT NULL,
    Administer_name text NOT NULL,
    
    primary key (Administer_id)
);

drop table if exists Locker;
CREATE TABLE Locker ( 
    Locker_id int NOT NULL,
    Locker_gender text NOT NULL,
    Administer_id int NOT NULL,
    
    primary key (Locker_id)
    foreign key (Administer_id) references Administer(Administer_id)
);

drop table if exists Trainer;
CREATE TABLE Trainer ( 
    Trainer_id text NOT NULL,
    Trainer_name text Not NULL,
    Administer_id int NOT NULL,

    primary key (Trainer_id),
    foreign key (Administer_id) references Administer(Administer_id) 
);

drop table if exists Equipment;
CREATE TABLE Equipment ( 
    Equipment_id text NOT NULL,
    Equipment_Check text Not NULL,
    Administer_id int NOT NULL,
    
    primary key (Equipment_id),
    foreign key (Administer_id) references Administer(Administer_id)
);

drop table if exists PT;
CREATE TABLE PT ( 
    Age_group text Null,
    Ten int NULL,
    Twenty int NULL,
    Thirty int NULL
);

drop table if exists Cost;
CREATE TABLE Cost( 
    Age_group text NULL,
    OneMonth int NULL,
    ThreeMonth int NULL, 
    SixMonth int NULL,
    Year int NULL,
    Locker_cost int NULL
);

 * sqlite:///DBproject.db
(sqlite3.OperationalError) database is locked
[SQL: drop table if exists Administer;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [4]:
%%sql
insert into Administer (Administer_id, Administer_name) values(1001,'이강욱');

insert into Administer (Administer_id, Administer_name) values(1002,'정현경');

 * sqlite:///DBproject.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Administer.Administer_id
[SQL: insert into Administer (Administer_id, Administer_name) values(1001,'이강욱');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [5]:
%%sql
select Administer_id as _관리자ID, Administer_name as _관리자
from Administer

 * sqlite:///DBproject.db
Done.

[(1001, '이강욱'), (1002, '정현경')]

In [6]:
%%sql
insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values ('시티드로우1', '중상', 1001);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('레그프레스1', '상', 1001);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('레그컬1', '중', 1001);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('랫풀다운1', '상', 1001);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('벤치프레스1', '최상', 1001);
  
insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('레그익스텐션1', '상', 1001);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('인클라인벤치프레스1', '최상', 1001);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('브이스쿼트1', '상', 1001);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('런닝머신1', '상', 1002);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('런닝머신2', '상', 1002);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('런닝머신3', '중', 1002);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('사이클1', '최상', 1002);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('사이클2', '최상', 1002);
 
insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('사이클3', '최상', 1002);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('티바로우1', '중상', 1001);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('스미스머신1', '최상', 1001);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('바벨5kg', '중', 1002);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('바벨10kg', '중', 1002);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('바벨15kg', '중', 1002);

insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values('바벨20kg', '중', 1002);

 * sqlite:///DBproject.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Equipment.Equipment_id
[SQL: insert into Equipment (Equipment_id, Equipment_Check, Administer_id) values ('시티드로우1', '중상', 1001);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [7]:
%%sql
select Equipment_id as _기구ID , Equipment_Check as _상태, Administer_id as _관리자ID
from Equipment

 * sqlite:///DBproject.db
Done.

[('시티드로우1', '중상', 1001),
 ('레그프레스1', '상', 1001),
 ('레그컬1', '중', 1001),
 ('랫풀다운1', '상', 1001),
 ('벤치프레스1', '최상', 1001),
 ('레그익스텐션1', '상', 1001),
 ('인클라인벤치프레스1', '최상', 1001),
 ('브이스쿼트1', '상', 1001),
 ('런닝머신1', '상', 1002),
 ('런닝머신2', '상', 1002),
 ('런닝머신3', '중', 1002),
 ('사이클1', '최상', 1002),
 ('사이클2', '최상', 1002),
 ('사이클3', '최상', 1002),
 ('티바로우1', '중상', 1001),
 ('스미스머신1', '최상', 1001),
 ('바벨5kg', '중', 1002),
 ('바벨10kg', '중', 1002),
 ('바벨15kg', '중', 1002),
 ('바벨20kg', '중', 1002)]

In [8]:
%%sql 
insert into Trainer (Trainer_id, Trainer_name, Administer_id) values('R01', '로니콜먼', 1001);

insert into Trainer (Trainer_id, Trainer_name, Administer_id) values('A02', '아놀드 슈왈츠제너거', 1001);
 
insert into Trainer (Trainer_id, Trainer_name, Administer_id) values('C03', '크리스 범스테드', 1001);

insert into Trainer (Trainer_id, Trainer_name, Administer_id) values('F04', '필 히스', 1002);

insert into Trainer (Trainer_id, Trainer_name, Administer_id) values('H05', '하디추판', 1002);

insert into Trainer (Trainer_id, Trainer_name, Administer_id) values('J06', '주민수', 1002);

 * sqlite:///DBproject.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Trainer.Trainer_id
[SQL: insert into Trainer (Trainer_id, Trainer_name, Administer_id) values('R01', '로니콜먼', 1001);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [9]:
%%sql
select Trainer_id as _트레이너ID, Trainer_name as _이름, Administer_id as _관리자ID
from Trainer

 * sqlite:///DBproject.db
Done.

[('R01', '로니콜먼', 1001),
 ('A02', '아놀드 슈왈츠제너거', 1001),
 ('C03', '크리스 범스테드', 1001),
 ('F04', '필 히스', 1002),
 ('H05', '하디추판', 1002),
 ('J06', '주민수', 1002)]

In [10]:
%%sql
insert into Locker (Locker_id, Locker_gender, Administer_id) values(1, '남', 1001);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(2, '남', 1001);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(3, '남', 1001);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(4, '남', 1001);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(5, '남', 1001);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(6, '남', 1001);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(7, '남', 1001);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(8, '남', 1001);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(9, '남', 1001);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(10, '남', 1001);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(11, '여', 1002);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(12, '여', 1002);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(13, '여', 1002);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(14, '여', 1002);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(15, '여', 1002);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(16, '여', 1002);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(17, '여', 1002);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(18, '여', 1002);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(19, '여', 1002);

insert into Locker (Locker_id, Locker_gender, Administer_id) values(20, '여', 1002);

 * sqlite:///DBproject.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Locker.Locker_id
[SQL: insert into Locker (Locker_id, Locker_gender, Administer_id) values(1, '남', 1001);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [11]:
%%sql
select Locker_id as _라커ID, Locker_gender as _성별, Administer_id as _관리자ID
from Locker

 * sqlite:///DBproject.db
Done.

[(1, '남', 1001),
 (2, '남', 1001),
 (3, '남', 1001),
 (4, '남', 1001),
 (5, '남', 1001),
 (6, '남', 1001),
 (7, '남', 1001),
 (8, '남', 1001),
 (9, '남', 1001),
 (10, '남', 1001),
 (11, '여', 1002),
 (12, '여', 1002),
 (13, '여', 1002),
 (14, '여', 1002),
 (15, '여', 1002),
 (16, '여', 1002),
 (17, '여', 1002),
 (18, '여', 1002),
 (19, '여', 1002),
 (20, '여', 1002)]

In [12]:
%%sql
insert into PT (Age_group, Ten, Twenty, Thirty) values('청소년(14~19)', 300000, 500000, 600000);

insert into PT (Age_group, Ten, Twenty, Thirty) values('성인(20~59)', 450000, 700000, 850000);

insert into PT (Age_group, Ten, Twenty, Thirty) values('노년(60~)', 350000, 460000, 530000);

 * sqlite:///DBproject.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
%%sql
select Age_group as _연령층, Ten as _10회, Twenty as _20회, Thirty as _30회 
from PT

 * sqlite:///DBproject.db
Done.

[('청소년(14~19)', 300000, 500000, 600000),
 ('성인(20~59)', 450000, 700000, 850000),
 ('노년(60~)', 350000, 460000, 530000),
 ('청소년(14~19)', 300000, 500000, 600000),
 ('성인(20~59)', 450000, 700000, 850000),
 ('노년(60~)', 350000, 460000, 530000)]

In [14]:
%%sql
insert into Cost (Age_group, OneMonth, ThreeMonth, SixMonth, Year, Locker_cost) values('청소년(14~19)', 50000, 120000, 190000, 330000, 10000);

insert into Cost (Age_group, OneMonth, ThreeMonth, SixMonth, Year, Locker_cost) values('성인(20~59)', 80000, 150000, 250000, 450000, 10000);

insert into Cost (Age_group, OneMonth, ThreeMonth, SixMonth, Year, Locker_cost) values('노년(60~)', 70000, 130000, 210000, 370000, 10000);

 * sqlite:///DBproject.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [15]:
%%sql
select Age_group as _연령층, OneMonth as _1달, ThreeMonth as _3달, SixMonth as _6달, Year as _1년, Locker_cost as _라커가격
from Cost

 * sqlite:///DBproject.db
Done.

[('청소년(14~19)', 50000, 120000, 190000, 330000, 10000),
 ('성인(20~59)', 80000, 150000, 250000, 450000, 10000),
 ('노년(60~)', 70000, 130000, 210000, 370000, 10000),
 ('청소년(14~19)', 50000, 120000, 190000, 330000, 10000),
 ('성인(20~59)', 80000, 150000, 250000, 450000, 10000),
 ('노년(60~)', 70000, 130000, 210000, 370000, 10000)]

In [22]:
%%sql
select *
from Member

 * sqlite:///DBproject.db
Done.

[('Q012', '이강욱', '000428', '성인', '김해', '01033944618', '남', '네', 1, 'R01', 1001, 610000),
 ('A123', '정현경', '020515', '성인', '진주', '01012345678', '여', '네', 11, 'J06', 1001, 540000)]

In [20]:
%%sql
delete 
from Member
where Name ='정현경'

 * sqlite:///DBproject.db
2 rows affected.

[]